Revit 2026 API

# Settings Class

---

The settings object provides access to general components of the Autodesk Revit application, such as Categories.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Settings : APIObject
```
```vb
Public Class Settings
	Inherits APIObject
```
```cpp
public ref class Settings : public APIObject
```
```fsharp
type Settings =
    class
        inherit APIObject
    end
```

The Settings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project. |
|  | ElectricalSetting | Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type, demand factor, wire type in the Autodesk Revit application and project. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | TilePatterns | Retrieves an object that provides access to the TilePattern objects in the document. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace